-- * Задача №1
-- ? Напишите SQL-запрос к таблице products и выведите всю информацию 
-- ? о товарах, цена которых не превышает 100 рублей. Результат отсор-
-- ? тируйте  по возрастанию id товара.
-- ? Поля в результирующей таблице: product_id, name, price

SELECT product_id, name, price
FROM   products
WHERE  price <= 100
ORDER BY product_id ASC


-- ! ==============================================================
-- * Задача №2
-- ? Отберите пользователей женского пола (female) из таблицы users.
-- ? Выведите только id этих пользователей. Результат отсортируйте 
-- ? по возрастанию id. Добавьте в запрос оператор LIMIT и выведите
-- ? только 1000 первых id из отсортированного списка.
-- ? Поле в результирующей таблице: user_id

SELECT user_id
FROM   users
WHERE  sex = 'female'
ORDER BY user_id asc limit 1000


-- ! ==============================================================
-- * Задача №3
-- ? Отберите из таблицы user_actions все действия пользователей по
-- ? созданию заказов, которые были совершены ими после полуночи 6
-- ? сентября 2022 года. Выведите колонки с id пользователей, id 
-- ? созданных заказов и временем их создания. Результат должен 
-- ? быть отсортирован по возрастанию id заказа.
-- ? Поля в результирующей таблице: user_id, order_id, time

SELECT user_id, order_id, time
FROM user_actions
WHERE action = 'create_order' AND time >= '2022-09-06 00:00'
ORDER BY order_id


-- ! ==============================================================
-- * Задача №4 
-- ? Назначьте скидку 20% на все товары из таблицы products и 
-- ? отберите те, цена на которые с учётом скидки превышает 100
-- ? рублей. Выведите id товаров, их наименования, прежнюю цену и
-- ? новую цену с учётом скидки. Колонку со старой ценой назовите
-- ? old_price, с новой — new_price. Результат должен быть 
-- ? отсортирован по возрастанию id товара.
-- ? Поля в результирующей таблице: product_id, name, old_price, new_price

SELECT 
  product_id, 
  name,
  price as old_price,
  price * 0.80 as new_price
FROM products
WHERE (price * 0.80) > 100 
ORDER BY product_id


-- ! ==============================================================
-- * Задача №5 
-- ? Отберите из таблицы products все товары, названия которых либо
-- ? начинаются со слова «чай», либо состоят из пяти символов. 
-- ? Выведите две колонки: id товаров и их наименования. Результат 
-- ? должен быть отсортирован по возрастанию id товара. Поля в 
-- ? результирующей таблице: product_id, name

SELECT product_id, name
FROM products
WHERE name LIKE 'чай %' OR LENGTH(name) = 5 
ORDER BY product_id


SELECT product_id,
       name
FROM   products
WHERE  split_part(name, ' ', 1) = 'чай'
    or length(name) = 5
ORDER BY product_id


-- ! ==============================================================
-- * Задача №6 
-- ? Отберите из таблицы products все товары, содержащие в своём 
-- ? названии последовательность символов «чай» (без кавычек). 
-- ? Выведите две колонки: id продукта и его название.
-- ? Результат должен быть отсортирован по возрастанию id товара.
-- ? Поля в результирующей таблице: product_id, name

SELECT product_id, name
FROM products
-- WHERE  name like '%чай%'
WHERE name ILIKE '%чай%'
ORDER BY product_id
