-- * Задача №12
-- ? Напишите SQL-запрос к таблице courier_actions, чтобы узнать id и 
-- ? время доставки последних 10 заказов, доставленных курьером с id 100.
-- ? Поля в результирующей таблице: order_id, time

-- ! Лучшее решение
SELECT order_id time
FROM   courier_actions
WHERE  courier_id = 100 and action = 'deliver_order'
ORDER BY time desc limit 10

-- ! Иное решение
SELECT order_id, time FROM courier_actions
WHERE  courier_id = 100
ORDER BY action = 'accept_order', time DESC
LIMIT 10



-- ! ==============================================================
-- * Задача №13
-- ? Из таблицы user_actions получите id всех заказов, сделанных пользователями 
-- ? сервиса в августе 2022 года. Результат отсортируйте по возрастанию id заказа.
-- ? Поле в результирующей таблице: order_id

-- ! Лучшее решение
SELECT order_id
FROM   user_actions
WHERE  action = 'create_order'
   and date_part('month', time) = 8
   and date_part('year', time) = 2022
ORDER BY order_id

-- ! Иное решение
SELECT order_id FROM user_actions
WHERE DATE_PART('month', time) = 08 AND action = 'create_order'
ORDER BY order_id asc



-- ! ==============================================================
-- * Задача №14
-- ? Из таблицы couriers отберите id всех курьеров, родившихся в период 
-- ? с 1990 по 1995 год включительно.
-- ? Результат отсортируйте по возрастанию id курьера.
-- ? Поле в результирующей таблице: courier_id

-- ! Лучшее решение
SELECT courier_id FROM couriers
WHERE DATE_PART('year', birth_date) BETWEEN 1990 AND 1995
ORDER BY courier_id

-- ! Иное решение
SELECT courier_id FROM couriers
WHERE DATE_PART('year', birth_date) >= 1990 AND DATE_PART('year', birth_date) <= 1995
ORDER BY courier_id


-- ! ==============================================================
-- * Задача №15
-- ? Из таблицы user_actions получите информацию о всех отменах заказов, 
-- ? которые пользователи совершали в течение августа 2022 года по средам с
-- ? 12:00 до 15:59:59. Результат отсортируйте по убыванию id отменённых 
-- ? заказов. Поля в результирующей таблице: user_id, order_id, action, time


SELECT user_id, order_id, action, time FROM user_actions
WHERE 
  DATE_PART('year', time) = 2022 AND 
  DATE_PART('month', time) = 08 AND 
  -- Дни недели 3.00 - среда
  DATE_PART('dow', time) = 3.00 AND 
  -- Час с 12:00 по 15:59:59 включительно
  DATE_PART('hour', time) BETWEEN 12 AND 15 AND 
  action = 'cancel_order'
ORDER BY order_id desc


-- ! ==============================================================
-- * Задача №16
-- ? Вычислите НДС каждого товара в таблице products и рассчитайте цену без учёта НДС
-- ? Стоит учесть, что товары из списка налог составляет 10%. Для остальных товаров НДС
-- ? тот же — 20%. Выведите всю информацию о товарах, включая сумму налога и цену
-- ? без его учёта. Колонки с суммой налога и ценой без НДС назовите соответственно tax
-- ? и price_before_tax. Округлите значения в этих колонках до двух знаков после запятой.
-- ? Результат отсортируйте сначала по убыванию цены товара без учёта НДС затем по возрастанию
-- ? Поля в результирующей таблице: product_id, name, price, tax, price_before_tax

SELECT
  product_id,
  name,
  price,
  CASE
     WHEN name IN(
      'сахар', 'сухарики', 'сушки', 'семечки',
      'масло льняное', 'виноград', 'масло оливковое',
      'арбуз', 'батон', 'йогурт', 'сливки', 'гречка',
      'овсянка', 'макароны', 'баранина', 'апельсины',
      'бублики', 'хлеб', 'горох', 'сметана', 'рыба копченая',
      'мука', 'шпроты', 'сосиски', 'свинина', 'рис',
      'масло кунжутное', 'сгущенка', 'ананас', 'говядина',
      'соль', 'рыба вяленая', 'масло подсолнечное',
      'яблоки','груши', 'лепешка', 'молоко', 'курица',
      'лаваш', 'вафли', 'мандарины'
    ) THEN round(price / 110 * 10, 2)
    ELSE round(price / 120 * 20, 2)
    END AS tax,
  CASE
    WHEN name IN(
      'сахар', 'сухарики', 'сушки', 'семечки',
      'масло льняное', 'виноград', 'масло оливковое',
      'арбуз', 'батон', 'йогурт', 'сливки', 'гречка',
      'овсянка', 'макароны', 'баранина', 'апельсины',
      'бублики', 'хлеб', 'горох', 'сметана', 'рыба копченая',
      'мука', 'шпроты', 'сосиски', 'свинина', 'рис',
      'масло кунжутное', 'сгущенка', 'ананас', 'говядина',
      'соль', 'рыба вяленая', 'масло подсолнечное',
      'яблоки','груши', 'лепешка', 'молоко', 'курица',
      'лаваш', 'вафли', 'мандарины'
    ) THEN round(price - price / 110 * 10, 2)
    ELSE round(price - price / 120 * 20, 2)
    END AS price_before_tax
  FROM products 
  ORDER BY price_before_tax desc, product_id