-- * Задача №1
-- ? Выведите id всех уникальных пользователей из таблицы user_actions. 
-- ? Результат отсортируйте по возрастанию id.
-- ? Поле в результирующей таблице: user_id

SELECT DISTINCT user_id 
FROM user_actions
ORDER BY user_id


-- * Задача №2
-- ? Примените DISTINCT сразу к двум колонкам таблицы courier_actions 
-- ? и отберите уникальные пары значений courier_id и order_id.
-- ? Результат отсортируйте сначала по возрастанию id курьера, затем 
-- ? по возрастанию id заказа.
-- ? Поля в результирующей таблице: courier_id, order_id

SELECT DISTINCT courier_id, order_id 
FROM courier_actions
ORDER BY courier_id, order_id


-- ! ==============================================================
-- * Задача №3
-- ? Посчитайте максимальную и минимальную цены товаров в таблице
-- ? products. Поля назовите соответственно max_price, min_price.
-- ? Поля в результирующей таблице: max_price, min_price

SELECT
  MAX(price) as max_price, 
  MIN(price) as min_price
FROM
  products


-- ! ==============================================================
-- * Задача №4
-- ? Как вы помните, в таблице users у некоторых пользователей не были 
-- ? указаны их даты рождения.Посчитайте в одном запросе количество всех 
-- ? записей в таблице и количество только тех записей, для которых в
-- ? колонке birth_date указана дата рождения.
-- ? Колонку с общим числом записей назовите dates, а колонку с записями
-- ? без пропусков — dates_not_null.
-- ? Поля в результирующей таблице: dates, dates_not_null

SELECT
  COUNT(*) as dates,
  COUNT(birth_date) as dates_not_null
FROM
  users


-- ! ==============================================================
-- * Задача №5
-- ? Посчитайте количество всех значений в колонке user_id в таблице user_actions, 
-- ? а также количество уникальных значений в этой колонке (т.е. количество уникальных
-- ? пользователей сервиса).
-- ? Колонку с первым полученным значением назовите users, а колонку со вторым — unique_users.
-- ? Поля в результирующей таблице: users, unique_users

SELECT
  COUNT(user_id) as users,
  COUNT(DISTINCT user_id) as unique_users
FROM user_actions


-- ! ==============================================================
-- * Задача №6
-- ? Посчитайте количество курьеров женского пола в таблице couriers. 
-- ? Полученный столбец с одним значением назовите couriers.
-- ? Поле в результирующей таблице: couriers

SELECT COUNT(courier_id) as couriers
FROM couriers
WHERE sex = 'female'


-- ! ==============================================================
-- * Задача №7
-- ? Рассчитайте время, когда были совершены первая и последняя доставки 
-- ? заказов в таблице courier_actions. Колонку с временем первой доставки 
-- ? назовите first_delivery, а колонку с временем последней — last_delivery.
-- ? Поля в результирующей таблице: first_delivery, last_delivery

SELECT 
  MIN(time) as first_delivery,
  MAX(time) as last_delivery
FROM courier_actions
WHERE action = 'deliver_order'



-- ! ==============================================================
-- * Задача №8
-- ? Представьте, что один из пользователей сервиса сделал заказ, в 
-- ? который вошли одна пачка сухариков, одна пачка чипсов и 1 энергетический 
-- ? напиток. Посчитайте стоимость такого заказа.
-- ? Колонку с рассчитанной стоимостью заказа назовите order_price.
-- ? Для расчётов используйте таблицу products. Поле в результирующей таблице: order_price

SELECT SUM(price) as order_price
FROM products
WHERE name IN ('сухарики', 'чипсы', 'энергетический напиток')