-- * Задача №9
-- ? Посчитайте количество заказов в таблице orders с 9 и более товарами. 
-- ? Для этого воспользуйтесь функцией array_length, отфильтруйте данные по
-- ? количеству товаров в заказе и проведите агрегацию. Полученный столбец
-- ? назовите orders.
-- ? Поле в результирующей таблице: orders

SELECT 
  COUNT(product_ids) as orders
FROM orders
WHERE array_length(product_ids, 1) >= 9
    


-- ! ==============================================================
-- * Задача №10
-- ? С помощью функции AGE и агрегирующей функции рассчитайте возраст самого 
-- ? молодого курьера мужского пола в таблице couriers. Возраст выразите
-- ? количеством лет, месяцев и дней (как в примере выше), переведя в VARCHAR
-- ? В качестве даты, относительно которой считать возраст курьеров, используйте 
-- ? свою текущую дату (либо не указывайте её на месте первого аргумента, как показано 
-- ? в примерах). Полученную колонку со значением возраста назовите min_age.
-- ? Поле в результирующей таблице: min_age

SELECT AGE(current_date, birth_date)::VARCHAR as min_age
FROM couriers
WHERE sex = 'male' AND birth_date is not NULL
ORDER BY birth_date desc
LIMIT 1


SELECT min(age(birth_date))::varchar as min_age
FROM   couriers
WHERE  sex = 'male'



-- ! ==============================================================
-- * Задача №11 
-- ? Посчитайте стоимость заказа, в котором будут три пачки сухариков, 
-- ? две пачки чипсов и один энергетический напиток. Колонку с 
-- ? рассчитанной стоимостью заказа назовите order_price.
-- ? Для расчётов используйте таблицу products и поле назовите order_price.
SELECT
    SUM(
        CASE
        WHEN name = 'энергетический напиток' THEN price
        WHEN name = 'чипсы' THEN price * 2
        WHEN name = 'сухарики' THEN price * 3
        END
    ) as order_price
from products
WHERE name IN('чипсы', 'энергетический напиток', 'сухарики')


SELECT sum(case when name = 'сухарики' then price * 3
                when name = 'чипсы' then price * 2
                when name = 'энергетический напиток' then price
                else 0 end) as order_price
FROM   products




-- ! ==============================================================
-- * Задача №12
-- ? Рассчитайте среднюю цену товаров в таблице products, в названиях которых присутствуют 
-- ? слова «чай» или «кофе». Любым известным способом исключите из расчёта товары, содержащие 
-- ? в названии «иван-чай» или «чайный гриб».
-- ? Среднюю цену округлите до двух знаков после запятой. Столбец с полученным значением 
-- ? назовите avg_price. Поле в результирующей таблице: avg_price

SELECT
    round(avg(price), 2) as avg_price
from products
WHERE name LIKE 'чай %' OR name LIKE '%кофе %'


SELECT round(avg(price), 2) as avg_price
FROM   products
WHERE  (name ilike '%чай%'
    or name ilike '%кофе%')
   and name not ilike '%иван-чай%'
   and name not ilike '%чайный гриб%'



-- ! ==============================================================
-- * Задача №13
-- ? Воспользуйтесь функцией AGE и рассчитайте разницу в возрасте между самым старым 
-- ? и самым молодым пользователями женского пола в таблице users. 
-- ? Разницу в возрасте выразите количеством лет, месяцев и дней, переведя её в тип VARCHAR. 
-- ? Колонку с посчитанным значением назовите age_diff.
-- ? Поле в результирующей таблице: age_diff

SELECT 
  AGE(max(birth_date), min(birth_date))::VARCHAR AS age_diff
FROM   users
WHERE  sex = 'female'