-- ? Первое измерение в массиве - вернет 4
SELECT ARRAY_LENGTH(ARRAY[10, 20, 30, 40], 1)
SELECT ARRAY_LENGTH(ARRAY['a', 'b', 'c', 40], 1)

-- ? Двумерный массив()
SELECT ARRAY_LENGTH(ARRAY[[1, 2, 3],[4, 5, 6]], 1);  => 2 => [1, 2, 3] и [4, 5, 6]
SELECT ARRAY_LENGTH(ARRAY[[1, 2, 3],[4, 5, 6]], 2);  => 3 => потому что внутри каждого вложенного массива по 3 элемента
SELECT ARRAY_LENGTH(ARRAY[[1, 2, 3],[4, 5]], 2);     => Вызовет ошибку, так как многомерный массив должен быть "прямоугольным".  
SELECT ARRAY_LENGTH(ARRAY[[1, 2, 3],[4, 5, 6]], 3);  => null, так как нет третьего измерения