-- ! Задача №1
-- ? С помощью оператора GROUP BY посчитайте кол-во курьеров
-- ? мужского и женского пола в таблице couriers. Новую
-- ? колонку с числом курьеров назовите couriers_count.
-- ? Результат отсортируйте по этой колонке по возрастанию.
-- ? Поля в результирующей таблице: sex, 
SELECT SEX, COUNT(SEX) as couriers_count
FROM couriers
GROUP BY sex
ORDER BY couriers_count



-- ! =====================================================
-- ! Задача №2
-- ? Посчитайте количество созданных и отменённых заказов 
-- ? в таблице user_actions. Новую колонку с числом заказов
-- ? назовите orders_count.
-- ? Результат отсортируйте по числу заказов по возрастанию.
-- ? Поля в результирующей таблице: action, orders_count
SELECT action, COUNT(action) as orders_count
FROM user_actions
GROUP BY action
ORDER BY orders_count



-- ! =====================================================
-- ! Задача №3
-- ? Используя группировку и функцию DATE_TRUNC, приведите 
-- ? все даты к началу месяца и посчитайте, сколько заказов 
-- ? было сделано в каждом из них.
-- ? Расчёты проведите по таблице orders. Колонку с усечённой 
-- ? датой назовите month, колонку с количеством заказов — orders_count.
-- ? Результат отсортируйте по месяцам — по возрастанию.
-- ? Поля в результирующей таблице: month, orders_count
SELECT
  DATE_TRUNC('month', creation_time) as month,
  COUNT(DATE_TRUNC('month', creation_time)) as orders_count
FROM orders
GROUP BY month
ORDER BY month



-- ! =====================================================
-- ! Задача №4
-- ? Используя группировку и функцию DATE_TRUNC, приведите все даты '
-- ? к началу месяца и посчитайте, сколько заказов было сделано и 
-- ? сколько было отменено в каждом из них.
-- ? В этот раз расчёты проведите по таблице user_actions. Колонку 
-- ? с усечённой датой назовите month, колонку с количеством заказов 
-- ? — orders_count.
-- ? Результат отсортируйте сначала по месяцам — по возрастанию, затем по типу 
-- ? действия — тоже по возрастанию. Поля в таблице: month, action, orders_count

SELECT DATE_TRUNC('month', time) as month,
       action,
       COUNT(order_id) as orders_count
FROM   user_actions
GROUP BY month, action
ORDER BY month, action



-- ! =====================================================
-- ! Задача №5
-- ? По данным в таблице users посчитайте максимальный порядковый номер 
-- ? месяца среди всех порядковых номеров месяцев рождения пользователей 
-- ? сервиса. С помощью группировки проведите расчёты отдельно в двух 
-- ? группах — для пользователей мужского и женского пола.

-- ? Новую колонку с максимальным порядковым номером месяца рождения в 
-- ? группах назовите max_month. Преобразуйте значения в новой колонке в
-- ? формат INTEGER, чтобы порядковый номер был выражен целым числом.
-- ? Результат отсортируйте по колонке с полом пользователей.
-- ? Поля в результирующей таблице: sex, max_month

SELECT sex,
       max(date_part('month', birth_date))::integer as max_month
FROM   users
GROUP BY sex
ORDER BY sex



-- ! =====================================================
-- ! Задача №6
-- ? По данным в таблице users посчитайте порядковый номер месяца рождения 
-- ? самого молодого пользователя сервиса. С помощью группировки проведите
-- ? расчёты отдельно в двух группах — для пользователей мужского и женского 
-- ? пола.

-- ? Новую колонку c порядковым номером месяца рождения самого молодого 
-- ? пользователя в группах назовите max_month. Преобразуйте значения в новой 
-- ? колонке в формат INTEGER, чтобы порядковый номер был выражен целым числом.
-- ? Результат отсортируйте по колонке с полом пользователей.
-- ? Поля в результирующей таблице: sex, max_month

SELECT
   sex,
   DATE_PART('month', MAX(birth_date))::integer as max_month
FROM users
GROUP BY sex
ORDER BY sex


-- * Задача №5 - мы сначала округляем даты, а затем находим среди них мин.
-- * Задача №6 - мы сначала находим минимальную дату и затем округлить её.



-- ! =====================================================
-- ! Задача №7
-- ? Посчитайте максимальный возраст пользователей мужского и женского пола в 
-- ? таблице users. Возраст измерьте числом полных лет.
-- ? Новую колонку с возрастом назовите max_age. Преобразуйте значения в новой 
-- ? колонке в формат INTEGER, чтобы возраст был выражен целым числом.
-- ? Результат отсортируйте по новой колонке по возрастанию возраста.
-- ? Поля в результирующей таблице: sex, max_age

SELECT
  sex,
  --  MAX(DATE_PART('year', AGE(current_date, birth_date))::INTEGER) AS max_age
   DATE_PART('year', MAX(AGE(current_date, birth_date)))::INTEGER AS max_age
FROM users
GROUP BY sex
ORDER BY max_age;

