-- ! Задание №8
-- ? Разбейте пользователей из таблицы users на группы по возрасту 
-- ? и посчитайте кол-во пользователей каждого возраста.
-- ? Колонку с возрастом назовите age, а колонку с числом пользователей — users_count.
-- ? Преобразуйте значения в колонке с возрастом в формат INTEGER, чтобы возраст 
-- ? был выражен целым числом.
-- ? Результат отсортируйте по колонке с возрастом по возрастанию.
-- ? Поля в результирующей таблице: age, users_count

SELECT
    DATE_PART('year', age(birth_date))::integer as age,
    COUNT(user_id) as users_count
FROM users
GROUP BY age
ORDER BY age



-- ! ==========================================================================================
-- ! Задание №9 
-- ? Разбейте пользователей из таблицы users на группы по возрасту, только теперь добавьте 
-- ? в группировку ещё и пол пользователя. Затем посчитайте количество пользователей в каждой
-- ? половозрастной группе.
-- ? Все NULL значения в колонке birth_date заранее отфильтруйте с помощью WHERE.
-- ? Колонку с возрастом назовите age, а колонку с числом пользователей — users_count, имя колонки 
-- ? с полом оставьте без изменений. Преобразуйте значения в колонке с возрастом в формат INTEGER, 
-- ? чтобы возраст был выражен целым числом.
-- ? Отсортируйте полученную таблицу сначала по колонке с возрастом по возрастанию, затем по колонке 
-- ? с полом — тоже по возрастанию.
-- ? Поля в результирующей таблице: age, sex, users_count
SELECT
    DATE_PART('year', age(birth_date))::integer as age,
    sex,
    COUNT(user_id) as users_count
FROM users
WHERE birth_date IS NOT NULL
GROUP BY age, sex
ORDER BY age, sex



-- ! ==========================================================================================
-- ! Задание №10
-- ? Посчитайте количество товаров в каждом заказе, примените к этим значениям 
-- ? группировку и рассчитайте количество заказов в каждой группе за неделю с 
-- ? 29 августа по 4 сентября 2022 года включительно. Для расчётов используйте 
-- ? данные из таблицы orders.
-- ? Выведите две колонки: размер заказа и число заказов такого размера за указанный 
-- ? период. Колонки назовите соответственно order_size и orders_count.
-- ? 1. Результат отсортируйте по возрастанию размера заказа.
-- ? 2. Поля в результирующей таблице: order_size, orders_count

SELECT
  array_length(product_ids, 1) as order_size,
  COUNT(order_id) as orders_count
FROM
  orders
WHERE
  DATE_PART('day', creation_time) IN(29, 30, 31, 1, 2, 3, 4)
  AND DATE_PART('month', creation_time) BETWEEN 08 AND 09
  AND DATE_PART('year', creation_time) = 2022 
GROUP BY order_size

-- ! Лучшее решение
SELECT array_length(product_ids, 1) as order_size,
       count(order_id) as orders_count
FROM   orders
WHERE  creation_time >= '2022-08-29' AND creation_time < '2022-09-05'
GROUP BY order_size
ORDER BY order_size



-- ! ==========================================================================================
-- ! Задание №11
-- ? Посчитайте количество товаров в каждом заказе, примените к этим значениям груп-
-- ? пировку и рассчитайте количество заказов в каждой группе. Учитывайте только
-- ? заказы, оформленные по будням. В результат включите только те размеры заказов,
-- ? общее число которых превышает 2000. Для расчётов используйте данные из таблицы orders.

-- ? Выведите две колонки: размер заказа и число заказов такого размера. Колонки назовите 
-- ? соответственно order_size и orders_count. Результат отсортируйте по возрастанию размера заказа.
-- ? Поля в результирующей таблице: order_size, orders_count



-- ! Задача № 11.1
-- ? Когда решите эту задачу, вернитесь к одной из предыдущих и подумайте, могли бы мы ещё 
-- ? каким-то способом сделать так, чтобы в результат не попала группа с NULL значениями. 
-- ? Можете самостоятельно написать ещё один запрос и попробовать сдать его в качестве альтер.решения.