-- ! Задание №8
-- ? Разбейте пользователей из таблицы users на группы по возрасту 
-- ? и посчитайте кол-во пользователей каждого возраста.
-- ? Колонку с возрастом назовите age, а колонку с числом пользователей — users_count.
-- ? Преобразуйте значения в колонке с возрастом в формат INTEGER, чтобы возраст 
-- ? был выражен целым числом.
-- ? Результат отсортируйте по колонке с возрастом по возрастанию.
-- ? Поля в результирующей таблице: age, users_count

SELECT
    DATE_PART('year', age(birth_date))::integer as age,
    COUNT(user_id) as users_count
FROM users
GROUP BY age
ORDER BY age



-- ! ==========================================================================================
-- ! Задание №9 
-- ? Разбейте пользователей из таблицы users на группы по возрасту, только теперь добавьте 
-- ? в группировку ещё и пол пользователя. Затем посчитайте количество пользователей в каждой
-- ? половозрастной группе.
-- ? Все NULL значения в колонке birth_date заранее отфильтруйте с помощью WHERE.
-- ? Колонку с возрастом назовите age, а колонку с числом пользователей — users_count, имя колонки 
-- ? с полом оставьте без изменений. Преобразуйте значения в колонке с возрастом в формат INTEGER, 
-- ? чтобы возраст был выражен целым числом.
-- ? Отсортируйте полученную таблицу сначала по колонке с возрастом по возрастанию, затем по колонке 
-- ? с полом — тоже по возрастанию.
-- ? Поля в результирующей таблице: age, sex, users_count
