-- Задача №8 - Измените тип колонки price из таблицы products на VARCHAR. Выведите колонки 
-- с наименованием товаров, ценой в исходном формате и ценой в формате VARCHAR. Новую колонку 
-- с ценой в новом формате назовите price_char.
-- Результат отсортируйте по возрастанию наименования товара в колонке name. Количество выводимых 
-- записей не ограничивайте. Поле в результирующей таблице: name, price, price_char

SELECT
  name,
  price,
  cast(price as varchar) as price_char
  -- price::varchar as price_char
FROM  products
ORDER BY  name


-- ! =============================================================


-- Задача №9 - Для первых 200 записей из таблицы orders выведите информацию в следующем 
-- виде (обратите внимание на пробелы): Заказ № [id заказа] создан [дата]
-- Полученную колонку назовите order_info.
-- Пример вывода: Заказ № 65 создан 2022-09-01
SELECT
  CONCAT(
    'Заказ ', '№ ', order_id, 
    ' создан ', creation_time::DATE
  ) as order_info
FROM orders
LIMIT 200

SELECT concat('Заказ № ', order_id, ' создан ', date(creation_time)) as order_info
FROM   orders limit 200


-- ! =============================================================


-- Задание №10 - Выведите id всех курьеров и их годы рождения из таблицы couriers. Год рождения
-- необходимо получить из колонки birth_date. Новую колонку с годом назовите birth_year. 
-- Результат отсортируйте сначала по убыванию года рождения курьера (т.е. от самых младших 
-- к самым старшим), затем по возрастанию id курьера. Поля в результирующей таблице: courier_id, 
-- birth_year

SELECT courier_id, DATE_PART('year', birth_date) as birth_year
FROM couriers
ORDER BY birth_year desc, courier_id


-- ! =============================================================


-- Задание №11* - Как и в предыдущем задании, снова выведите id всех курьеров и их годы рождения, только
-- теперь к извлеченному году примените функцию COALESCE. Укажите параметры функции так, чтобы вместо NULL 
-- значений в результат попадало текстовое значение unknown. Названия полей оставьте прежними.
-- Отсортируйте итоговую таблицу сначала по убыванию года рождения курьера, затем по возрастанию id курьера.
-- Поля в результирующей таблице: courier_id, birth_year
SELECT 
  courier_id, 
  COALESCE(DATE_PART('year', birth_date as varchar), 'unknown') as birth_year
FROM couriers
ORDER BY 
  birth_year desc,
  courier_id


-- ! =============================================================


-- Задание №12 - Повышаем все цены в таблице на 5% - Выведите id и наименования всех товаров, 
-- их старую и новую цену. Колонку со старой ценой назовите old_price, а колонку с новой — new_price.
-- Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.
-- Поля в результирующей таблице: product_id, name, old_price, new_price

SELECT 
  product_id,
  name,
  price as old_price,
  price * 1.05 as new_price
FROM products
ORDER BY 
 new_price desc,
 product_id 

