/* 
  Дана асинхронная функция fn и время t в миллисекундах, нужно вернуть новую
  версию этой функции, выполнение которой ограничено заданным временем. Функция fn 
  принимает аргументы, переданные в эту новую функцию.

  Возвращаемая функция работает по следующим правилам: 
  - если fn выполнится за заданное время t, то функция резолвит полученные данные;
  - если fn не выполнился за заданное время t, то функция реджектит строку "Time limit exceeded"
*/

const timeLimited = function (fn, t) {
  // Your code
}
